## 第五章 pandas入门

In [1]:
# 导入相关的库
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 5.1 pandas数据结构介绍
#### 5.1.1 Series

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj2 = pd.Series(data=[4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

index既是Series的一个属性，也是pandas库中的一个重要类型，后续会提及

In [4]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

逐元素操作

In [5]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [6]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [7]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

可以认为Series是一个长度固定且有序的字典

In [8]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(data=sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

pandas中利用NaN表示数据确实或超限

In [10]:
# pd.isnull()
obj4.isnull()
# obj4.notnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
# 在数学运算中索引自动对齐，对不存在的索引按照广播法则扩充
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

name 属性相当于Series或index的一个标签

In [12]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

#### 5.1.2 DataFrame
DataFrame是一个二维表格，它的每一列都是一个Series，并且这些Series共享一个index。也可以看做是相同索引的Series的字典，其关键字即为列名。每一列可以使不同的数据类型。

In [13]:
data = {'state':['ohio', 'ohio', 'ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [14]:
# 指定列的顺序
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [15]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [16]:
# frame2['state']
frame2.year  # 这种访问方式要求列名必须是Python的有效变量

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

可以通过访问的方式直接对列或行进行修改或赋值

行的获取可以使用loc属性  
`loc['行名'，‘列名’]`

In [20]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt        2
Name: three, dtype: object

In [21]:
frame2.loc['three', 'pop']

3.6

In [19]:
frame2['debt'] = np.arange(0.0, 6.0)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

利用Series赋值时，会与索引一一对应，缺失的地方为NaN

In [ ]:
val = pd.Series([1.4, 2.6, 3.8, 5.1], index=('two', 'four', 'five', 'seven'))
frame2['debt'] = val
frame2